{
    "header": {
        "navbar":{
            "home": "Home",
            "about": "About Me",
            "projects" : "Projects",
            "certifications": "Certifications",
            "contact": "Contact"
        },
        "language": {
            "selector": "Language selector",
            "en": "English",
            "es": "Spanish"
        }
    },
    "page": {
        "home": {
            "title": "Home",
            "desc": ""
        },
        "about": {
            "title": "About Me",
            "desc": "Let me share a bit about myself."
        },
        "projects": {
            "title": "Projects",
            "desc": "These are some of the projects I've been working on. Each one incorporates various technologies I've learned along the way. Feel free to check them out!"
        },
        "projectDetails":{
            "title": "Details",
            "desc": "Here are some details about this project. Feel free to take a look!"
        },
        "certifications": {
            "title": "Studies & Certifications",
            "desc": "These are the certifications I have obtained so far. I'm always looking forward to expanding my knowledge and acquiring new skills!"
        },
        "contact": {
            "title": "Contact",
            "desc": "Explore my social media accounts, and feel free to connect with me on any platform. Let's get in touch and start a conversation!"
        }
    },
    "home": {
        "message" : "Welcome to my portfolio. I'm Alan, a Full Stack developer specializing in the MERN Stack. This space is the result of dedication and passion, where each line of code tells a story of challenges overcome and innovative solutions. I invite you to explore and discover the digital world I've created. I hope your visit is inspiring, and may you have an excellent day."
    },
    "about": {
        "message": "Currently, I have knowledge in the field of web development, specifically in the MERN stack, and I'm applying these skills in various projects that test my capabilities. I am fully committed to programming, and I plan to add new skills to my stack, such as NextJS, SQL, and MySQL."
    },
    "projects": {
        "button": "More details",
        "loadingData": "Loading data. Please wait a moment."
    },
    "projectDetails": {
        "githubRepository": "GitHub repository",
        "projectSkills": "Skills used in the project:",
        "backButton": "Back to Projects"
    },
    "contact": {
        "linkedin": "Here's my LinkedIn profile. Take a look, and let's connect to expand our professional network!",
        "github": "Explore my GitHub profile for a glimpse into my coding projects!",
        "mail": "For direct communication, please feel free to email me. I will respond promptly.",
        "curriculum": "Download my curriculum here. Feel free to review it, and I welcome any potential project opportunities."
    
    },
    "curriculum":{
        "title": "Curriculum"
    },
    "certifications": {
        "button": "Link to certificate"
    },
    "skills": {
        "title": "Skills",
        "collections": {
            "frontend": "Frontend Development Stack",
            "backend-mern": "Backend MERN Development Stack"
        }

    },
    "navbar-button": {
        "name-open": "Display navbar",
        "name-close": "Close navbar",
        "description": "This, is the navbar display button. When is clicked, it shows a list with the sections of the website, clicking every section will take you to the selected section of the website."
    }
}