{
    "header": {
        "navbar":{
            "home": "Inicio",
            "about": "Sobre mí",
            "projects" : "Proyectos",
            "certifications": "Certificaciones",
            "contact": "Contacto"
        },
        "language": {
            "selector": "Selector de idioma",
            "en": "Inglés",
            "es": "Español"
        }
    },
    "page": {
        "home": {
            "title": "Inicio",
            "desc": ""
        },
        "about": {
            "title": "Sobre mí",
            "desc": "Permíteme compartir un poco de información sobre mí."
        },
        "projects": {
            "title": "Proyectos",
            "desc": "Estos son algunos de los proyectos en los que he estado trabajando. Cada uno incluye algunas de las tecnologías que he aprendido hasta ahora. ¡Siéntete libre de revisarlos!"
        },
        "projectDetails": {
            "title": "Detalles",
            "desc": "Aquí tienes algunos detalles sobre este proyecto. Siéntete libre de echar un vistazo."
        },
        "certifications": {
            "title": "Certificaciones",
            "desc": "Estas son las certificaciones que he obtenido hasta ahora. Siempre estoy buscando expandir mi conocimiento y adquirir nuevas habilidades."
        },
        "contact": {
            "title": "Contacto",
            "desc": "Aquí están mis cuentas de redes sociales. Siéntete libre de revisarlas y no dudes en ponerte en contacto. ¡Espero conocerte pronto!"
        }
    },
    "home": {
        "message" : "Bienvenido a mi portfolio. Soy Alan, un desarrollador Full Stack especializado en el Stack MERN. Este espacio es el resultado de dedicación y pasión, donde cada línea de código cuenta una historia de desafíos superados y soluciones innovadoras. Te invito a explorar y descubrir el mundo digital que he creado. Espero que tu visita sea inspiradora y que tengas un excelente día."
    },
    "about": {
        "job-title": "Desarrollador full stack",
        "message": "En la actualidad, poseo competencias en el desarrollo web, especializado en el Stack MERN, y me encuentro inmerso en el desarrollo de proyectos personales que desafían y evalúan mis habilidades. Mi compromiso con el crecimiento continuo me lleva a considerar la incorporación de nuevas tecnologías a mi repertorio, entre ellas NextJS, SQL y MySQL"
    },
    "projects": {
        "button": "Más detalles",
        "loadingData": "Cargando datos. Por favor espere un momento."
    },
    "projectDetails": {
        "githubRepository": "Repositorio de GitHub",
        "projectSkills": "Habilidades utilizadas en el proyecto:",
        "backButton": "Volver a Proyectos"
    },
    "contact": {
        "linkedin": "Este es mi perfil de LinkedIn. Échale un vistazo y conectémos para ampliar nuestra red profesional.",
        "github": "Explore mi perfil de GitHub para echar un vistazo a mis proyectos de codificación y logros.",
        "mail": "Para una comunicación directa, no dudes en enviarme un correo electrónico. Responderé prontamente.",
        "curriculum": "Descarga aquí mi currículum. Agradezco la revisión y estoy disponible para cualquier oportunidad de proyecto que pueda surgir."
        
    },
    "curriculum":{
        "title": "Curriculum"
    },
    "certifications": {
        "button": "Ir al certificado"
    },
    "skills": {
        "title": "Conocimientos y habilidades",
        "collections": {
            "frontend": "Desarrollo Frontend",
            "backend-mern": "Desarrollo Backend MERN"
        }
    },
    "navbar-button": {
        "name-open": "Abrir navbar",
        "name-close": "Cerrar navbar",
        "description": "This, is the navbar display button. When is clicked, it shows a list with the sections of the website, clicking every section will take you to the selected section of the website."
    }
}